
## Plan Result

[CI link](https://github.com/hayas1/tfgh/actions/runs/11754115490)


<pre><code>Plan: 2 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.repositories.github_repository_file.this[&#34;tfgh.github/workflows/labeler.yml&#34;]
  * module.repositories.github_repository_pull_request.managed[&#34;tfgh&#34;]
* Update
  * module.repositories.github_repository.this[&#34;tfgh&#34;]
  * module.repositories.github_repository_ruleset.this[&#34;tfgh&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.repositories.github_repository.this["tfgh"] will be updated in-place
  ~ resource "github_repository" "this" {
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "tfgh"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "tfgh"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        # (28 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories.github_repository_file.this["tfgh.github/workflows/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/workflows/labeler.yml"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            name: Pull Request Labeler
            on:
            - pull_request_target
            
            jobs:
              labeler:
                permissions:
                  contents: read
                  pull-requests: write
                runs-on: ubuntu-latest
                steps:
                - uses: actions/labeler@v5
        EOT
      + file                            = ".github/workflows/labeler.yml"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "tfgh"
      + sha                             = (known after apply)
    }

  # module.repositories.github_repository_pull_request.managed["tfgh"] will be created
  + resource "github_repository_pull_request" "managed" {
      + base_ref              = "main"
      + base_repository       = "tfgh"
      + base_sha              = (known after apply)
      + body                  = <<-EOT
            - .github/labeler.yml
            - .github/pull_request_template.md
            - .github/release.yml
            - .github/workflows/labeler.yml
        EOT
      + draft                 = (known after apply)
      + head_ref              = "chore/managed-by-terraform"
      + head_sha              = (known after apply)
      + id                    = (known after apply)
      + labels                = (known after apply)
      + maintainer_can_modify = false
      + number                = (known after apply)
      + opened_at             = (known after apply)
      + opened_by             = (known after apply)
      + state                 = (known after apply)
      + title                 = "files managed by Terraform"
      + updated_at            = (known after apply)
    }

  # module.repositories.github_repository_ruleset.this["tfgh"] will be updated in-place
  ~ resource "github_repository_ruleset" "this" {
        id          = "2549230"
        name        = "default"
        # (6 unchanged attributes hidden)

      + bypass_actors {
          + actor_id    = 5
          + actor_type  = "RepositoryRole"
          + bypass_mode = "pull_request"
        }

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":40,"Program":"tfcmt","SHA1":"564f9832f30c3d56e941719767a455d63db5c9bb","Vars":{},"WorkflowName":"Terraform plan on pull request"} -->